// Author: Daniel Fortes
// Version: 6.1.0.0 (04.01.2020)

// General

000 = Español
001 = Si
002 = No
003 = Aceptar
004 = Salir
005 = Panel Principal
006 = Panel de Reglas
007 = Busque el programa que usted quiere permitir
008 = Busque el programa que usted quiere bloquear
009 = Clic en una ventana del programa para permitir la conexión
010 = Clic en una ventana del programa para bloquear la conexión
011 = O clic en este dialogo para cancelar esta operacion
012 = Una nueva regla de permiso fue creada con éxito
013 = Una nueva regla de bloqueo fue creada con éxito
016 = La política completa se ha importado con éxito desde
017 = La política completa se ha exportado con éxito a
018 = La politica por defecto fue restaurada con éxito.
021 = Determina la ruta completa del archivo al cual esta regla corresponde
022 = La política parcial se ha importado con éxito desde
023 = La política parcial se ha exportado con éxito a
024 = Error al importar el archivo de políticas
025 = Error al exportar el archivo de políticas
028 = Conectado a la ubicación
029 = Obtener mas informacion
030 = Bloquear la configuracion actual del programa
031 = Desbloquear la configuracion actual del programa
032 = Bloquear
033 = Desbloquear
034 = Cancelar
035 = Por favor escriba su contraseña
036 = Escriba la contraseña para desbloquear
037 = Contraseña incorrecta
038 = Mostrar contraseña
039 = Ir al sitio web
040 = Ver Panel de Reglas de Windows Firewall Control
042 = ¿Seguro que deseas desactivar la protección del Firewall de Windows?
043 = No mostrar de nuevo
044 = Solo Lectura
045 = Las reglas de entrada con EdgeTraversal configuradas para "Defer to user" solo admiten una personalización limitada, por lo que algunas propiedades se desactivarán. ¿Quiere continuar?
046 = ¿Seguro que quieres eliminar esta regla?
050 = Propiedades Extendidas
051 = Esta regla contiene propiedades extra que se pueden configurar sólo desde WFwAS
052 = Contar
053 = Ninguna
060 = Ajustes de refresco
061 = Auto refrescar al abrir
070 = Estado General
071 = Ir a Malwarebytes Premium
072 = Abrir Malwarebytes
073 = Estado de Windows Firewall 
074 = Activado
075 = Desactivado
076 = Conexiones entrantes
077 = Conexiones salientes
078 = Permitir todo
079 = Permitir
080 = Bloquear
081 = Bloquear todo
 
// Tab items

100 = Perfiles
200 = Alertas
300 = Opciones
400 = Reglas
500 = Herramientas
600 = Acerca de

// Profiles

101 = El nivel de filtrado Indica qué conexiones deberían ser bloqueadas y que conexiones deberían ser permitidas
102 = Filtrado alto
103 = Todas las conexiones entrantes y salientes se bloquean. Este perfil bloquea todos los intentos de conexión desde y hacia su ordenador.
104 = Filtrado medio (recomendado)
105 = Las conexiones salientes que no coinciden con una regla serán bloqueadas. Sólo los programas con una regla de permiso serán permitidas.
106 = Filtrado bajo
107 = Las conexiones salientes que no coinciden con una regla serán permitidas. Sólo los programas con una regla de bloqueo serán bloqueadas.
108 = Sin filtrado
109 = El Firewall de Windows esta desactivado. Evite el uso de esta configuración a menos que tenga otro firewall en ejecución.
110 = Filtrado medio
111 = Indica el perfil que será revertido en caso de que se cambie a un perfil de filtrado inferior para fines de instalación o actualización
112 = Automáticamente
113 = después de
114 = minutos

// Notifications

201 = El modo de alertas especifica qué conexiones salientes bloqueadas deben mostrarse al usuario
204 = Mostrar alertas
205 = Mostrara las alertas de todas las conexiones salientes bloqueadas pero no se mostrara para los programas indicados como excepciones de alertas 
206 = Modo aprendizaje
207 = Crea automáticamente reglas salientes de permiso para los programas firmados digitalmente y mostrara sólo alertas para los programas sin firmar
208 = Desactivar
209 = No mostrar alertas.
210 = Opciones de alertas
211 = Cerrar automáticamente una alerta en
212 = segundos.
213 = Personalizar tiempo de espera para las reglas temporales 
214 = Reproducir un sonido cuando se genera una nueva alerta
215 = Reproducir sonido por defecto
216 = Reproducir sonido personalizado
217 = Por favor seleccione un sonido personalizado de alerta 
220 = Mostrar las alertas sobre otras ventanas
221 = Configuración avanzada de las alertas
222 = Reiniciar la configuración avanzada por defecto
223 = Usar reglas de permiso en reglas ya creadas.Si hay una regla ya creada,no se muestran alertas. Recomendado para la compatibilidad con otros programas de seguridad si se muestran alertas duplicadas.
224 = Usar reglas de bloqueo genéricas en reglas ya creadas. Si se aplica una regla de bloqueo a todos los programas que coincidan con la conexión bloqueada, no se mostrarán las alertas.
225 = Usar reglas desactivadas ya creadas. Si ya existe una regla desactivada creada no se mostrarán las alertas.
230 = Regla creada en Modo aprendizaje
240 = Indica más abajo los programas y carpetas que no deben mostrar alertas
241 = Excepciones de alertas
242 = Añadir excepción
243 = Quitar excepción
244 = Indicar aquí una nueva excepción
245 = Añadir a excepciones de alertas
246 = Excluir archivo 
247 = Excluir carpeta 

// Options

301 = Indica las opciones para solicitar todas las cuentas de usuario del ordenador local
302 = Integración con el menú contextual
303 = Integra el programa en el menú contextual de los ejecutables y los accesos directos de los archivos ejecutables.
304 = Iniciar automáticamente en el arranque de sesión del usuario
305 = Cuando se utiliza la característica Cambio rápido de usuario, esta opción se aplica para el primer inicio de sesión del usuario.
308 = Teclas rápidas globales.
309 = Teclas rápidas globales son métodos abreviados de teclado que se pueden utilizar dentro de cualquier aplicación que se ejecute.
321 = El perfil de Filtrado Alto está activado. Todas las conexiones de red están bloqueados hasta que el perfil se active manualmente.
324 = Importar, exportar o restaurar la configuración del usuario
325 = Importar la configuración del usuario desde un archivo
326 = Exportar la configuración del usuario a un archivo
327 = Restablecer todos los ajustes a los valores por defecto
328 = Ajustes de usuario exportados con éxito a
329 = Después de confirmar esta acción, el programa se reiniciará con el fin de recargar todos los ajustes. ¿Estás seguro de que quieres continuar?
330 = Permitir por Windows Firewall Control
331 = Bloquear por Windows Firewall Control
340 = Idioma de interfaz de usuario

// Rules

401 = Indica la dirección en la cual una nueva regla es aplicada al crear una nueva regla:
402 = Reglas salientes (recomendado)
403 = Por defecto sólo crea reglas de salida al crear nuevas reglas para permitir o bloquear aplicaciones.
404 = Reglas entrantes
405 = Por defecto sólo crea reglas de entrada. Utilice esta opción con precaución. Acceso de entrada se requiere generalmente para aplicaciones de servidor.
406 = Reglas salientes y entrantes
407 = Por defecto crea ambos tipos de reglas. No se recomienda.
408 = Indica la ubicación donde se aplica una nueva regla al crear una regla nueva:
409 = Importar, exportar o restaurar las reglas del firewall
410 = Importar las reglas de Windows Firewall Control desde un archivo
411 = Exportar las reglas de Windows Firewall Control a un archivo
412 = Restaurar por defecto un conjunto de reglas del Firewall de Windows
413 = Restaurar las reglas recomendadas de Windows Firewall Control
414 = Se ha seleccionado un archivo de política completa. Importar las reglas del firewall de este archivo sobrescribe todas las reglas actuales del Firewall de Windows. Si desea guardar una copia de sus reglas actuales, primero debe exportarlas a un archivo. ¿Desea usted importar las reglas del firewall desde el archivo seleccionado?
415 = Restaurar a un conjunto de reglas por defecto restablecerán todos los cambios en la configuración del Firewall de Windows que ha realizado desde que Windows fue instalado. Esto puede provocar que algunos programas dejan de funcionar. ¿Desea continuar?
416 = Importar desde archivo ...
417 = Exportar a archivo...
418 = Las reglas recomendadas por WFC se han creado con éxito.
419 = Por favor, refresque las reglas en el Panel de Reglas.Gracias.
420 = Esta acción borrará todos los registros de Windows Firewall Control. ¿Está usted seguro de continuar ?
421 = Se ha seleccionado un archivo de política parcial. Importar las reglas del firewall de este archivo dejará sus reglas actuales sin cambios y las normas contenidas en este archivo serán añadidas a su actual conjunto de reglas. ¿Desea usted importar las reglas del firewall desde el archivo seleccionado?
422 = El archivo no es accesible o tiene un formato no válido!
423 = La restauración de las reglas recomendadas por WFC volverán a crearse otra vez. Las reglas vigentes actuales permanecerán sin cambios. ¿Quieres continuar ?
450 = Seguridad
451 = Especifique a continuación las mejoras de seguridad que serán aplicadas por Windows Firewall Control
452 = Arranque seguro
453 = Se ajustara automáticamente el perfil de filtrado alto al apagar el sistema . En el inicio de Windows, las conexiones de red serán bloqueados hasta que el usuario cambie manualmente el perfil.
454 = Reglas seguras 
455 = Habilite la protección contra reglas del firewall que no se crean en los grupos autorizados definidos a continuación. Esto se aplica a las reglas de firewall recién creadas y a las existentes.
456 = Grupos autorizados
457 = Añadir grupo
458 = Quitar grupo
459 = Indicar aquí un nuevo grupo autorizado
460 =Advertencia. Se eliminarán o deshabilitarán todas las reglas del firewall, incluidas las reglas del firewall predeterminadas del Firewall de Windows, que tienen un nombre de grupo diferente al indicado por los grupos autorizados. Se recomienda crear una copia de seguridad de sus reglas actuales. ¿Estás seguro de que quieres continuar?"
461 =Importar nombres de grupo de las reglas existentes actuales 
462 =Las normas NO autorizadas deben ser automáticamente
463 = eliminadas
464 = desactivadas
465 =Use solo el signo @ para excluir las reglas del firewall definidas para las aplicaciones de Windows 10
466 =Se detectaron reglas sin grupo indicado. Para conservarlos, ¿desea agregar estas reglas al grupo de Windows Firewall Control antes de habilitar las reglas seguridad?
467 = Autorizar grupo
470 = Perfil seguro
471 = Proteja el estado de Windows Firewall contra manipulaciones externas. Cuando esta característica está activada, la importación de reglas del firewall y cambiar el modo de filtrado solo se pueden realizar a través de este programa.
475 = Eliminar reglas no autorizadas
476 = Desactivar reglas no autorizadas
477 = Permitir reglas de Windows Store 

// Tools

501 = Use los accesos directos de abajo para lanzar varias utilidades del sistema. Tenga en cuenta que estos programas se deben ejecutar con los privilegios más altos disponibles.
502 = Firewall de Windows con Seguridad Avanzada
503 = Visor de Sucesos
504 = Monitor de Recursos
505 = Panel de Control de Subprogramas del Firewall de Windows
510 = Indica los servicios URL usados para varias verificaciones
511 = URL para comprobar la reputación de direcciones IP
512 = URL para comprobar el hash SHA256 del archivo
513 = URL para iniciar una consulta WHOIS
514 = URL para leer más sobre un puerto específico
520 = Copiar...
521 = Todo

// About

601 = Acerca del programa
602 = Comprobar si hay una nueva versión disponible
603 = No se puede conectar al servidor de actualizaciones. Asegúrese de tener la regla necesaria para permitir conexiones de este programa y una configuración de proxy correcta, si es necesario.
605 = No hay nueva versión en este momento.
606 = Disponible nueva versión de Windows Firewall Control
607 = ¿Quiere descargar y actualizar a esta nueva versión?
608 = Ver registro de cambios
610 = Todos los derechos reservados.
611 = Notificaciones de terceros
612 = Acuerdo de licencia de usuario final (EULA)
621 = Tipos de Interfaz
622 = Todos los tipos de interfaz
623 = Especificar tipos de interfaz
624 = Red de área local
625 = Acceso remoto
626 = Wifi
627 = Entrante
628 = Saliente
629 = Ambos
640 = Borde Traversal
641 = Ajustes ICMP
642 = Congelar primera columna
680 = Entradas
681 = Todas las entradas
682 = Última entrada
690 = Comprobación automática de actualizaciones
691 = Usar configuración proxy
692 = Configuración proxy
693 = Dirección
694 = Nombre de usuario
695 = Contraseña
699 = Origen del proceso

// Manage Rules

700 = ID del Proceso 
701 = Nombre
702 = Grupo
703 = Programa
704 = Ubicación
705 = Activado
706 = Acción
707 = Dirección
708 = Ip Local
709 = Puerto Local 
710 = Ip Remota
711 = Puerto Remoto
712 = Protocolo
713 = Servicio
714 = Descripcion
715 = Fecha y Hora
716 = Acciónes
717 = Refrescar lista
718 = Mostrar reglas invalidas
719 = Limpiar registros
720 = Buscar reglas
721 = Registro de Conexiones
722 = Ver Registro de Conexiones de Windows Firewall Control
723 = Ver
724 = Mostrar 
725 = Últimas 100 conexiones
726 = Últimas 500 conexiones
727 = Todas las conexiones
728 = conexiones
729 = Configuración de columnas
730 = Mostrar
731 = reglas
732 = Todas las reglas
733 = Reglas entrantes
734 = Reglas salientes
735 = Reglas creadas por mi
736 = Filtrar
737 = Sin filtro
738 = Filtrar por permitido
739 = Filtrar por bloqueado
740 = Buscar
741 = Registros de conexiones
742 = Politicas...
743 = Importar reglas desde un archivo
744 = Exportar todas las reglas
745 = Exportar reglas seleccionadas
746 = Restaurar reglas por defecto
747 = Restaurar reglas recomendadas
748 = Conexiones permitidas
749 = Conexiones bloqueadas
750 = Crear nueva regla
751 = Buscar para permitir
752 = Clic para permitir
753 = Buscar para bloquear
754 = Clic para bloquear
755 = Permitir este programa
756 = Bloquear este programa
757 = Regla en blanco
758 = Personalizar y crear
759 = Desactivar el registro de conexiones bloqueadas también desactiva las notificaciones. ¿Desea usted continuar?
760 = Opciones
761 = Permitir
762 = Bloquear
763 = Activar
764 = Desactivar
765 = Eliminar
766 = Propiedades
767 = Duplicar
768 = General
769 = Avanzado
770 = Aplicar
771 = Protocolos y puertos
772 = Direcciones IP remotas y locales
773 = Entrante
774 = Saliente
775 = Dominio
776 = Privado
777 = Público
778 = Todo
779 = Crear
780 = Cualquiera
781 = Todos los Puertos
782 = Puertos Personalizados
783 = Direcciones personalizadas
784 = Todos los Programas
785 = Programa
786 = Buscar...
787 = Ej: 80,443,9-29
788 = Ej: 50.22.79.60
792 = Utilice el botón Refrescar o la tecla F5 para cargar los datos
793 = Por favor espere...
794 = Añadir al grupo
795 = Restablecer orden
796 = Conexiones
797 = Recien bloqueado
798 = Recien permitido
799 = Mostrar reglas duplicadas

// Notification dialog

800 = La conexión saliente fue bloqueada
801 = Origen
802 = Remoto
803 = Firmado
804 = Ip Remota
805 = Personalice esta regla antes de crearla
806 = PERMITIR ESTE PROGRAMA
807 = Permite al programa tener acceso a Internet
808 = BLOQUEAR ESTE PROGRAMA
809 = Bloquea al programa tener acceso a Internet
810 = Bloquear por el momento y pregúntar más tarde
811 = Aplicar esta acción temporalmente
812 = Comprobar este archivo
813 = Iniciar busqueda WHOIS
814 = Verificar esta ruta IP
815 = Abrir ruta del archivo
816 = Abrir propiedades de archivo
817 = Copiar ruta al portapapeles
818 = Lea más sobre el puerto
819 = Volver a los detalles de la regla
823 = Permitir temporalmente
824 = Bloquear temporalmente 
825 = Hasta reiniciar WFC
830 = Fusionar reglas
831 = Reglas fusionadas
840 = Aplicar a todos los programas y servicios
841 = Aplicar sólo a los servicios
850 = Dirección de origen
851 = Puerto de origen
852 = Dirección de destino
853 = Puerto de destino

// Validations

920 = Por favor escriba un nombre de regla
921 = Los espacios vacios no son permitidos
922 = El puerto debe ser un valor entre 0 y 65535
923 = Por favor escriba un rango de IP valida
924 = Por favor escriba una ruta IP valida
925 = Los parametros duplicados no son permitidos
926 = Los parametros vacíos no son permitidos
927 = Los parámetros negativos no son permitidos
928 = Rango de puerto invalido
929 = El campo no puede estar vacio
930 = Este archivo no existe
931 = Extensiones soportadas
932 = Este campo debe ser un valor numérico entre 0 y 999
933 = Máscara de subred no válida
934 = Este campo debe ser un valor numérico entre 1 y 60
935 = Campo obligatorio
936 = Regla Inválida. La ruta del programa para esta regla no existe en el disco.
940 = No se puede conectar con el servicio de Windows Firewall Control

// Uninstall

950 = Desinstalar
951 = Esto eliminará el programa de su ordenador. Elija que auiere hacer con la configuración del Firewall de Windows actuales:
952 = Restablecer la configuración del Firewall de Windows por defecto. Todo usuario creado se eliminara y se mantendrá sólo las reglas predeterminadas del Firewall de Windows.
953 = Restaurar el estado a la instalacion previamente del programa. Todas las reglas anteriores que se encuentran en la instalación del programa se restaurarán.
954 = Seguir con las reglas y la configuración del firewall actuales. Eliminar este programa solamente y guardar todas las demas opciones y reglas como están en este momento.
956 = Desactivar registros del Firewall de Windows 
957 = Desinstalacion en progreso...